Revit 2026 API

# BumpMapBumpmapNormalScale Property

---

The property labeled "Amount" from the "BumpMap" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string BumpmapNormalScale { get; }
```
```vb
Public Shared ReadOnly Property BumpmapNormalScale As String
	Get
```
```cpp
public:
static property String^ BumpmapNormalScale {
	String^ get ();
}
```
```fsharp
static member BumpmapNormalScale : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

BumpMap Class

Autodesk.Revit.DB.Visual Namespace